using System;

namespace _001数据结构
{
    class Program
    {
        static void Main(string[] args)
        {
            //Data Structure
            //描述了数据的存储结构
            //相互之间存在一种或多种特定关系的数据元素的集合
            //在任何问题中，数据元素之间都不是孤立的，而是存在一定的关系，这种关系称为结构

            //分类
            //集合 数据元素除了存在同属于一个集合的关系外，不存在任何其他关系
            //线性结构 数据元素存在一对一关系
            //树形结构 数据元素存在一对多关系
            //图状结构 数据元素存在多对多关系

            //算法
            //操作数据
            //有基本运算及规定的运算顺序锁构成的完整的解题步骤
            //或看成按照要求设计好的有限的确切的计算序列，并且这样的步骤和序列可以解决一类问题

            //算法的评价标准
            //运行时间
            //占用空间
            //其他方面：正确性，可读性(是否易读)，健壮性(BUG率,崩溃率)
        }
    }
}
